[
  {
    "title": "Tricks of the Trade: Operating a Multi-Tier Cannabis Grow",
    "description": "During this presentation, Pipp Horticulture cultivation experts Michael Williamson, director of cultivation, and Anders Peterson, director of horticulture, share best practices for operating an indoor vertical cannabis farm through all stages of plant growth; tips to improve plant health and product quality; ideas to increase efficiency, streamline workflows and reduce costs, and insights into genetics, harvesting techniques, and more.",
    "link": "https://www.cannabisbusinesstimes.com/media/operating-multi-tier-cannabis-grow-webinar/",
    "event_type": "webinar",
    "author": "Pip Horticulture",
    "date": "November 15 2023"
  },
  {
    "title": "Revolutionizing Cannabis Cultivation With Aloe Vera",
    "description": "During this presentation, Coats Agri-Aloe CEO Ross Garrity and Texas-based VJ Farms Founder Ross Martinez provide an in-depth look at Aloe Vera’s surprising role in sustainable agriculture and cannabis cultivation; an overview of the research and completed studies on agricultural Aloe Vera and its effects on plant and crop growth; how Aloe420 reduces the reliance on chemicals and has zero negative environmental impact; and how Aloe420 provides solutions to the growing veganic movement.",
    "link": "https://www.cannabisbusinesstimes.com/media/revolutionizing-cannabis-cultivation-aloe-vera-webinar/",
    "event_type": "webinar",
    "author": "Unknown",
    "date": "November 01, 2023"
  },
  {
    "title": "Lowtemp Industries: How to Run a High Margin Solventless Extraction Lab",
    "description": "During this webinar, Cliff Haney, the Director of Marketing at Denver-based Lowtemp Industries, discusses the critical components of a high-margin solventless lab in today’s market and how to get the most out of solventless extraction. With the ever increasing popularity of live rosin, rosin cartridges, and a variety of other sought-after solventless SKUs, the need to make them as profitable as possible is critical for operators.",
    "link": "https://www.cannabisbusinesstimes.com/media/how-run-solventless-extraction-lab-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "October 18, 2023"
  },
  {
    "title": "BIOS Lighting: Unlocking the Secrets of LED Cultivation: Grower-to-Grower",
    "description": "During this webinar, the BIOS Lighting team engages in an insightful, grower-to-grower conversation about LEDs that goes deep into new and actionable strategies. Learn from real on-the-ground experiences of cultivators who've been there, done that, and thrived.",
    "link": "https://www.cannabisbusinesstimes.com/media/bios-lighting-unlocking-the-secrets-of-led-cultivation-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 25, 2023"
  },
  {
    "title": "AirGreen: Comparative Energy Analysis of Desiccant Technologies in Indoor Cannabis Cultivation, and How to Create a Durable, Competitive Cost Advantage",
    "description": "During this Webinar, the AirGreen team reviews the technologies and resultant energy analysis of a variety of dehumidification and climate control solutions installed at a cannabis cultivation facility, provide resultant energy analyses of each with operating cost estimates, and discuss advantages of investing in energy efficiency!",
    "link": "https://www.cannabisbusinesstimes.com/media/airgreen-desiccant-technologies-energy-analysis-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 02, 2023"
  },

  {
    "title": "Why Current THC Labeling Is Holding the Cannabis Industry Back  And What We Can Do About It",
    "description": "Flower is sold as weight percentage THC. Vape cartridges are labeled as THC/total weight of oil. But edibles manufacturers report their THC in milligrams per unit. Who can keep up with all this?",
    "link": "https://www.cannabisbusinesstimes.com/media/why-thc-labeling-holding-industry-back/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "June 06, 2023"
  },
  {
    "title": "Pipp Horticulture: Multi-Tier Grow Room Design: Measure Twice, Build Once",
    "description": "During this webinar, the Pipp team shares helpful insights and best practices on how to design a successful multi-tier indoor cannabis grow room. With topics ranging from pre-design considerations, to specifics on each growing system, all the way to starting up your room for the first time, you will walk away with the confidence grow vertically!",
    "link": "https://www.cannabisbusinesstimes.com/media/pipp-horticulture-multi-tier-room-design-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "April 21, 2023"
  },
  {
    "title": "Cannabis Genetics and the Supply Chain",
    "description": "In this panel discussion, breeders and growers discuss the disconnect between the retail segment and points further upstream.",
    "link": "https://www.cannabisbusinesstimes.com/media/genetics-supply-chain-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 14, 2023"
  },
  {
    "title": "California Lightworks: Converting a Traditional Greenhouse to a State-of-the-Art Cannabis Facility",
    "description": "Converting a traditional greenhouse to cannabis requires extensive transformation to be successful. California Lightworks' experienced panel of experts looks at all aspects of this process and the potential costs and pitfalls.",
    "link": "https://www.cannabisbusinesstimes.com/media/california-lightworks-converting-traditional-greenhouse-to-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 07, 2023"
  },
  {
    "title": "Cannabis Seeds Are Federally Legal: What Now?",
    "description": "Following the January 2022 DEA acknowledgement that cannabis seeds are federally \"legal\" under the 2018 Farm Bill, we attempt to clarify precisely what that means in this webinar.",
    "link": "https://www.cannabisbusinesstimes.com/media/cannabis-dea-seeds-federally-legal-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 02, 2023"
  },
  {
    "title": "Vitalis: Why Outdated Perceptions Are Holding You Back: The Evolution and Applications of Ethanol, CO2, CXE, and Multi-Solvent Extraction",
    "description": "Discover how using solvents like ethanol and CO2 together can give you dramatically better results in your extraction operations. Learn why a novel application of this old idea is the key to unlocking new product innovations, simplifying your processes, and maybe even saving your business.",
    "link": "https://www.cannabisbusinesstimes.com/media/vitalis-webinar-cosolvent-extraction-co2/",
    "event_type": "webinar",
    "author": "Vitalis Extraction Technology",
    "date": "January 31, 2023"
  },
  {
    "title": "Argus: Optimizing Your Cannabis Grow by Understanding Your Data",
    "description": "Learn how tracking data can help you improve your grow.",
    "link": "https://www.cannabisbusinesstimes.com/media/optimizing-your-cannabis-grow-understanding-data-argus/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 14, 2022"
  },
  {
    "title": "Rescheduling or Descheduling: How Future Federal Decisions May Impact the Industry",
    "description": "In this webinar, a panel of expert industry stakeholders will discuss the practical consequences of this federal crossroads—and how licensed businesses can prepare for the future.",
    "link": "https://www.cannabisbusinesstimes.com/media/rescheduling-descheduling-future-impact-industry/",
    "event_type": "webinar",
    "author": "",
    "date": "November 08, 2022"
  },
  {
    "title": "Current: Current Breakthroughs in LED Cannabis Research",
    "description": "This webinar features two new research trials on lighting and cannabis rooting.",
    "link": "https://www.cannabisbusinesstimes.com/media/current-led-research-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 01, 2022"
  },
  {
    "title": "Agrify: From Flower to Diamonds  How to Use Technology as Your Competitive Edge in Producing More and Higher Quality Cannabis SKUs Pt. II",
    "description": "This webinar provides answers to questions raised by the audience from Agrify's earlier webinar.",
    "link": "https://www.cannabisbusinesstimes.com/media/agrify-flower-diamonds-webinar-sequel/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 21, 2022"
  },

  {
    "title": "Grower Spotlight: Rair Cannabis Co.",
    "description": "In this interview, Ashley Hubbard shares insights into aeroponic production at Rair's Michigan facility.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-ashley-hubbard-rair/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 14, 2022"
  },
  {
    "title": "Agrify: From Flower to Diamonds  How to Use Technology as Your Competitive Edge in Producing More and Higher Quality Cannabis SKUs",
    "description": "This webinar dives into the technology that is required to maintain high-quality products from cultivation through extraction and post-processing.",
    "link": "https://www.cannabisbusinesstimes.com/media/agrify-from-flower-to-diamonds-use-technology-competitive-edge/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 31, 2022"
  },
  {
    "title": "HUB International: Making the Connection Between Risk Management and Profitability: A Guide for Cannabis Operators",
    "description": "Knowing how to put in place essential risk management and insurance programs will keep you compliant and protected as you grow.",
    "link": "https://www.cannabisbusinesstimes.com/media/making-the-connection-between-risk-management-profitability-hub-international-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 08, 2022"
  },
  {
    "title": "Navigating California: Tips From Seasoned Operators and Experts",
    "description": "In this special 90-minute presentation, Angela Pih (StateHouse Holdings), Jocelyn Sheltraw (Headset), Claudio Miranda (Guild Extracts) and Swami Chaitanya and Nikki Lastreto (Swami Select) share tips for California plant-touching cannabis operators in today's market as it relates to price compression, retail scarcity/imbalance, resource-intensive sales and marketing support, and much more.",
    "link": "https://www.cannabisbusinesstimes.com/media/navigating-california-tips-seasoned-operators/",
    "event_type": "webinar",
    "author": "",
    "date": "July 27, 2022"
  },
  {
    "title": "The Original Resinator: Profiting from Live Dried: The Next Wave of Craft Cannabis",
    "description": "Cannabis plants dried and cured in under 24 hours? The Original Resinator team explains how.",
    "link": "https://www.cannabisbusinesstimes.com/media/original-resinator-live-freeze-dried-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "July 21, 2022"
  },
  {
    "title": "MyAdvice: 4 Ways Digital Marketing Can Help You Grow Your Cannabis Business",
    "description": "In this webinar, Michael Antosy and Connor Morris from MyAdvice provide you with the tools and guidance you need to gain market share, retain more clients and be successful in your digital marketing efforts.",
    "link": "https://www.cannabisbusinesstimes.com/media/my-advice-digital-marketing-webinar-grow-cannabis-business/",
    "event_type": "webinar",
    "author": "Cannabis Business Times staff",
    "date": "July 20, 2022"
  },
  {
    "title": "Seasoned California Operators to Provide Tips for Navigating State's Troubled Market in Free Webinar",
    "description": "The live webinar, hosted by Cannabis Business Times and Cannabis Conference, will take place July 26 at 10 a.m. PT.",
    "link": "https://www.cannabisbusinesstimes.com/news/seasoned-california-operators-to-provide-tips-for-navigating-states-troubled-market-in-free-webinar/",
    "event_type": "webinar",
    "author": "Posted by Carlie Reese",
    "date": "July 05, 2022"
  },
  {
    "title": "FOHSE: 7 Misconceptions About LED Grow Lights",
    "description": "Because the technology is relatively new, rumors and hearsay surround LED grow lights wherever they are implemented. In this webinar, FOHSE sheds light on some common misconceptions concerning LED grow lighting.",
    "link": "https://www.cannabisbusinesstimes.com/media/fohse-webinar-7-misconceptions-led-grow-lights/",
    "event_type": "webinar",
    "author": "",
    "date": "June 27, 2022"
  },
  {
    "title": "PurePressure: SKU Selections: Hydrocarbon, Distillate, and Solventless",
    "description": "This presentation explores the variety of end products (SKUs) that are made using distillation, hydrocarbon, or solventless extraction.",
    "link": "https://www.cannabisbusinesstimes.com/media/purepressure-sku-selections-hydrocarbon-distillate-solventless-cannabis-webinar/",
    "event_type": "webinar",
    "author": "",
    "date": "June 22, 2022"
  },
  {
    "title": "IRS Audits: Mistakes to Avoid",
    "description": "In this webinar, Nick Richards, Partner & Chair of the Cannabis Law Group at Greenspoon Marder, a former IRS Attorney, will share actionable tips that will equip your business in the event of a federal audit.",
    "link": "https://www.cannabisbusinesstimes.com/media/irs-audits-mistakes-to-avoid/",
    "event_type": "webinar",
    "author": "",
    "date": "June 14, 2022"
  },
 
  {
    "title": "Upwise Capital: Cannabis Business Financing on the Front Lines: Unsecured and Secured Debt Lending Options",
    "description": "In this webinar, you will get answers to your questions about financing in the cannabis industry, no matter your experience level.",
    "link": "https://www.cannabisbusinesstimes.com/media/upwise-capital-secured-unsecured-debt-financing-cannabis-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "June 01, 2022"
  },
  {
    "title": "Emerald Harvest: Heavy Metals: The Good, The Bad and the Ugly",
    "description": "Heavy metals are everywhere even in fertilizers. But which ones are toxic, which ones are safe, and which ones are considered safe “within tolerable limits”?",
    "link": "https://www.cannabisbusinesstimes.com/media/emerald-harvest-heavy-metals-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "May 24, 2022"
  },
  {
    "title": "How to Launch a Social Consumption Lounge",
    "description": "Are you interested in launching a cannabis and/or hemp social consumption lounge—but don’t know where to start? Lounge operators from coast to coast including Sara Stewart of Green Thumb Industries, Mason Walker of The Hemp Bar and Kyle Moon of The Summit Private Lounge share their insights.",
    "link": "https://www.cannabisbusinesstimes.com/media/how-to-launch-a-social-consumption-lounge/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "April 27, 2022"
  },
  {
    "title": "Agrify: Extraction & Consumer Product Creation: Choosing the Right Supplier",
    "description": "From extraction equipment & technologies through post processing, distillation, and product creation it is extremely important that businesses choose the right supplier & partner to their business to ensure success and state-of-the-art operations.",
    "link": "https://www.cannabisbusinesstimes.com/media/agrify-extraction-division-choosing-right-supplier-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 31, 2022"
  },
  {
    "title": "Grower Spotlight: Green Bodhi",
    "description": "In this interview, Green Bodhi owner John Bayes explains the philosophical underpinnings of his cultivation strategy. Sponsored by Fohse.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-green-bodhi/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 21, 2022"
  },
  {
    "title": "Supply Chain Challenges and Cannabis: A Global Outlook for 2022",
    "description": "Amid equipment shortages and shipping delays, how should cannabis businesses strategically pivot?",
    "link": "https://www.cannabisbusinesstimes.com/media/supply-chain-webinar-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 01, 2022"
  },
  {
    "title": "BSI: The Benefits of GMP for the Cannabis Industry",
    "description": "In this presentation, the BSI crew walks us through the rationale and practical action items involved with GMP certification in cannabis.",
    "link": "https://www.cannabisbusinesstimes.com/media/bsi-gmp-benefits-cannabis-industry-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 25, 2022"
  },
  {
    "title": "Emerald Harvest:  Plants Can't Tell the Difference: Understanding the Pros and Cons of Organic and Mineral Fertilizers",
    "description": "In this presentation, Emerald Dan provides an in-depth understanding of different types of fertilizer sources.",
    "link": "https://www.cannabisbusinesstimes.com/media/emerald-harvest-webinar-organic-inorganic-fertilizer/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 23, 2022"
  },
  {
    "title": "AGronomic IQ: Maximizing Your Investment with Smart HVAC Decisions",
    "description": "Geoff Brown, VP of Product & Business Development at AGronomic IQ, discusses how to make informed decisions when investing in a commercial grow HVAC system.",
    "link": "https://www.cannabisbusinesstimes.com/media/agronomic-iq-maximize-hvac-investment-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 03, 2022"
  },
  {
    "title": "Grower Spotlight: A Vant Garden",
    "description": "CBT Conference Programming Director Cassie Tomaselli interviews A Vant Garden Co-Owner and Operations Manager Ryan Johnson about his entrepreneurial background.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-a-vant-garden/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 02, 2022"
  },

  {
    "title": "Argus Controls: Precision in Your Growing Environment Is Key to a Profitable Operation",
    "description": "Striving for precision in your growing environment will translate into gaining total control of the process and having the ability to dial in the most specific details of your operation.",
    "link": "https://www.cannabisbusinesstimes.com/media/argus-controls-webinar-precision-growing-environment/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "December 02, 2021"
  },
  {
    "title": "LED, HPS and Hybrid Lighting Systems: Calculating the True ROI",
    "description": "This presentation covers key strategies and pointers on how to build a true and complete ROI when considering LED, HPS and hybrid lighting technologies",
    "link": "https://www.cannabisbusinesstimes.com/media/led-hps-hybrid-lighting-pl-light-systems-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "October 28, 2021"
  },
  {
    "title": "Rad Source Technologies: Remediation Technology Matters",
    "description": "This webinar provided information about Rad Source’s Cannabis Decontamination Technology (420 series).",
    "link": "https://www.cannabisbusinesstimes.com/media/rad-source-technology-remediation-cannabis-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "October 11, 2021"
  },
  {
    "title": "Quest: How to Make Your Grow Room HVAC Work for You",
    "description": "This webinar focuses on dehumidification and how to properly size, specify and install your solution, as well as new tools and resources available to growers.",
    "link": "https://www.cannabisbusinesstimes.com/media/quest-webinar-make-your-grow-room-hvac-work/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 30, 2021"
  },
  {
    "title": "PurePressure: How To: Designing a Solventless Processing Lab",
    "description": "If you're planning to open a processing or extraction lab in the cannabis space and want to profit from top shelf solventless products, this webinar is for you.",
    "link": "https://www.cannabisbusinesstimes.com/media/purepressure-designing-solventless-processing-lab-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 21, 2021"
  },
  {
    "title": "BSI: GMP for Cannabis: Understanding Regulatory Requirements",
    "description": "Join our BSI cannabis experts to learn more about GMP and how to get started towards existing and future compliance requirements.",
    "link": "https://www.cannabisbusinesstimes.com/media/bsi-webinar-gmp-regulatory-requirements/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "September 03, 2021"
  },
  {
    "title": "How to Market Your Cannabis Products for Mood, Effect and Dosage",
    "description": "\"Indica\" and \"sativa\" just don't cut it anymore. Here's how brands are describing their products to consumers.",
    "link": "https://www.cannabisbusinesstimes.com/media/mood-marketing-webinar-cannabis-effect-dosage/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 19, 2021"
  },
  {
    "title": "Premier Tech: Mycorrhizae: Bringing Value to Your Cannabis Plants",
    "description": "this webinar will help you understand how a good mycorrhizae product can enhance the value of your plants' roots, translating into increased yields and shorter vegetative time.",
    "link": "https://www.cannabisbusinesstimes.com/media/premier-tech-webinar-mycorrhizae/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "July 29, 2021"
  },
  {
    "title": "Delta-8 THC: The Latest Research, Policy and Opportunities",
    "description": "What do you need to know about delta-8 THC right now? Find out!",
    "link": "https://www.cannabisbusinesstimes.com/media/delta-8-webinar-greg-gerdeman-justin-walsh/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "July 29, 2021"
  },
  {
    "title": "Grower Spotlight: Aeriz",
    "description": "CBT Editorial Director Noelle Skodzinski talks with Steve Bundy, general manager for Aeriz. Sponsored by Surna.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-steve-bundy-aeriz-surna/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "July 26, 2021"
  },

  {
    "title": "HUB International: Cannabis Risk Management Essentials: What You Need to Know to Improve Your Bottom Line",
    "description": "In this webinar, the team at HUB International discusses the many risks that a cannabis business may face—and how to navigate them.",
    "link": "https://www.cannabisbusinesstimes.com/media/hub-international-cannabis-risk-management-essentials/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "July 06, 2021"
  },
  {
    "title": "Kason: Advances in Drying - Cannabis Processing Meets Tomorrow's Tech",
    "description": "This webinar covers technological advances that increase throughput and quality, while reducing burn, lost byproducts and energy costs.",
    "link": "https://www.cannabisbusinesstimes.com/media/kason-drying-cannabis-webinar-technology-advances/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "May 06, 2021"
  },
  {
    "title": "Applied DNA Sciences: How to Remove Uncertainty from Cannabis Traceability and Transparency",
    "description": "This webinar explores innovative technology solutions to ensure your raw materials and finished products can be tracked throughout your supply chain.",
    "link": "https://www.cannabisbusinesstimes.com/media/applied-dna-sciences-tracking-tracing-transparency-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "April 20, 2021"
  },
  {
    "title": "Arborjet: Improve Your Profit Margin: Performance-Driven Pest Management Solutions That Pay for Themselves",
    "description": "In this webinar, the urban-gro team discusses pest management solutions that improve your profit margin.",
    "link": "https://www.cannabisbusinesstimes.com/media/arborjet-integrated-pest-management-webinar-urban-gro/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 26, 2021"
  },
  {
    "title": "Grower Spotlight: Lume Cannabis Co.",
    "description": "A conversation exploring Lume Cannabis’ state-of-the-art cultivation operations and methods, and its science-based and data-driven decision-making model. Sponsored by Fohse.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-lume/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 26, 2021"
  },
  {
    "title": "Fohse: 7.19 lbs/light, 108g/sf: How The Grove Attained the Unbelievable",
    "description": "Mike Howard, former director of cultivation at The Grove in Nevada, shares the decisions and methods that enabled his team to achieve unbelievable results.",
    "link": "https://www.cannabisbusinesstimes.com/media/fohse-webinar-yield-lighting-lbs-grams-the-grove-nevada/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 16, 2021"
  },
  {
    "title": "BSI: Three Simple Steps Towards GMP Certification",
    "description": "Join our BSI's cannabis experts to learn more about GMP and how to get started towards existing and future compliance requirements.",
    "link": "https://www.cannabisbusinesstimes.com/media/bsi-webinar-gmp-good-manufacturing-practices-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 02, 2021"
  },
  {
    "title": "GroAdvisor: Turnkey Extraction Facilities: Considerations and Methodologies",
    "description": "Learn how to startup your next extraction facility based on experience from the GroAdvisor team.",
    "link": "https://www.cannabisbusinesstimes.com/media/groadvisor-turnkey-extraction-facilities-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 24, 2021"
  },
  {
    "title": "Grower Spotlight: Legion of Bloom",
    "description": "In this installment of Grower Spotlight, Editorial Director Noelle Skodzinski interviews Troy Meadows from Legion of Bloom: Sponsored by Emerald Harvest.",
    "link": "https://www.cannabisbusinesstimes.com/media/grower-spotlight-legion-bloom-cannabis-troy-meadows/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 01, 2021"
  },
  {
    "title": "California Lightworks: Slash Lighting Costs with the New MegaDrive LED System",
    "description": "By moving the individual drivers from each LED fixture into a central power supply, both fixture and installation costs are dramatically reduced with the MegaDrive system.",
    "link": "https://www.cannabisbusinesstimes.com/media/california-lightworks-megadrive-led-system-costs/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "January 27, 2021"
  },
  
  {
    "title": "GroAdvisor: Value-Engineering Your Cannabis Cultivation",
    "description": "Learn how to value-engineer your cannabis cultivation based on experience from the GroAdvisor team.",
    "link": "https://www.cannabisbusinesstimes.com/media/groadvisor-webinar-value-engineering-cannabis-facility/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "January 21, 2021"
  },
  {
    "title": "Argus Controls: The Importance of Consistency and Uniformity in the Drying Process",
    "description": "Argus Controls' panel of experts demonstrate the importance of uniformity and consistency in the drying process.",
    "link": "https://www.cannabisbusinesstimes.com/media/argus-controls-webinar-uniformity-consistency-drying/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 20, 2020"
  },
  {
    "title": "Valoya: Latest Developments in Research on LED for Cannabis",
    "description": "Valoya Research Director Stiina Kotiranta presents the latest breakthroughs in LED lighting applications for cannabis to help growers understand how to push their plants to produce at least a few percent more cannabinoids or flower mass.",
    "link": "https://www.cannabisbusinesstimes.com/media/valoya-latest-developments-in-research-on-led-for-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 03, 2020"
  },
  {
    "title": "PurePressure: Success with Solventless: How to Leverage Rosin to Attract Customers",
    "description": "This webinar is intended to be the intermediate-level follow up to PurePressure's previous webinar; however, both beginners and experts will find plenty of information worth tuning in for.",
    "link": "https://www.cannabisbusinesstimes.com/media/purepressure-webinar-success-solventless-leverage-rosin-attract-customers/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 24, 2020"
  },
  {
    "title": "BSI: Creating a Successful Business Framework Using ISO 9001 and HACCP & GMP",
    "description": "Experts from BSI share how ISO 9001 and HACCP & GMP allow you the opportunity to create a successful framework while ensuring product quality, safety, and customer satisfaction.",
    "link": "https://www.cannabisbusinesstimes.com/media/bsi-iso-9001-haccp-gmp-webinar-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "August 04, 2020"
  },
  {
    "title": "PurePressure: Solventless Extraction Explained: Profiting from Rosin",
    "description": "PurePressure's Director of Marketing will help give you the tools, strategies, and key information on how to capitalize on this quickly growing subsegment of the market.",
    "link": "https://www.cannabisbusinesstimes.com/media/purepressure-solventless-extraction-webinar-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "June 05, 2020"
  },
  {
    "title": "Emerald Harvest: The Importance of Nutrients for Maximizing Return on Your Grow",
    "description": "In this webinar and panel discussion, experts from the Emerald Harvest team will discuss the role nutrients play in having a flawless grow.",
    "link": "https://www.cannabisbusinesstimes.com/media/emerald-harvest-nutrients-webinar-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "June 05, 2020"
  },
  {
    "title": "P.L. Light Systems: The Pros and Cons of Vertical Growing",
    "description": "In this webinar, P.L. Light's sales manager explores the benefits and potential drawbacks of growing cannabis indoors in a vertical application.",
    "link": "https://www.cannabisbusinesstimes.com/media/pl-light-systems-vertical-growing-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "April 29, 2020"
  },
  {
    "title": "Essential Cannabis Businesses and COVID-19: Addressing Your Top Supply Chain and Retail Challenges",
    "description": "Produced by Cannabis Business Times and Cannabis Dispensary, a close look at how the industry is responding to the coronavirus outbreak: As cannabis businesses navigate emergent economic pressures in the U.S. and elsewhere.",
    "link": "https://www.cannabisbusinesstimes.com/media/covid-19-essential-cannabis-businesses-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "April 08, 2020"
  },
  {
    "title": "Fluence by OSRAM: 9 Key Parameters of Plant Production",
    "description": "As cannabis companies concentrate on consumer needs, growers are working to advance and switch production methods to generate cannabis cultivars that meet market demand.",
    "link": "https://www.cannabisbusinesstimes.com/media/fluence-osram-cannabis-parameters-cultivation-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 19, 2020"
  },
 
  {
    "title": "Arborjet: IPM Programs and Your Crop: Improving Quality and Uield",
    "description": "Join veteran cannabis growers and regulators as they lead a discussion around effective IPM programs and how a professionally developed, SOP-based IPM program can help ensure your success and compliance.",
    "link": "https://www.cannabisbusinesstimes.com/media/arborjet-urban-gro-ipm-integrated-pest-management-cannabis-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 26, 2020"
  },
  {
    "title": "Best Practices on Energy Efficient Cultivation: Understanding Key Terms, Maximizing Utility Incentives and Optimizing Profit",
    "description": "Join leading indoor cultivators who contributed to Resource Innovation Institute's peer-reviewed Best Practices Guides on LED Lighting and HVAC for Cannabis Cultivation.",
    "link": "https://www.cannabisbusinesstimes.com/media/resource-innovation-institute-best-practices-energy-efficient-cannabis-grow-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 11, 2020"
  },
  {
    "title": "Surna: What to Expect When You're Expanding or Retrofitting",
    "description": "You may have one cannabis cultivation facility and are looking to expand and/or retrofit, or you may have already added to your portfolio of facilities either by new builds or acquisitions.",
    "link": "https://www.cannabisbusinesstimes.com/media/surna-expanding-retrofitting-cannabis-cultivation-facility-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "January 23, 2020"
  },
  {
    "title": "Fund Your Business: Options for Raising Capital and Navigating M&A",
    "description": "In this webinar, two financial markets experts will help you understand the trends shaping capital raises and the financial perspectives you’ll need to successfully navigate these waves of corporate consolidation and integration.",
    "link": "https://www.cannabisbusinesstimes.com/media/fund-your-business-cannabis-capital-fundraising-mergers-acquisitions-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "January 13, 2020"
  },
  {
    "title": "Genetics Advice for Cannabis Cultivation Start-Ups",
    "description": "Cannabis cultivation expert Ryan Douglas discusses cultivar selection for your business. Questions that he addresses include: How many varieties should I begin with? Should I start from clone or seed?",
    "link": "https://www.cannabisbusinesstimes.com/media/genetics-advice-cannabis-cultivation-startups-webinar-cannabis/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "January 06, 2020"
  },
  {
    "title": "Argus Controls: Maximizing Quality and Yields Through Plant-Centric Automated Controls",
    "description": "When making the transition to LED lighting at your cannabis cultivation facility, growers, operations and business owners must take into account all environmental controls your lighting decision will impact.",
    "link": "https://www.cannabisbusinesstimes.com/media/argus-controls-webinar-plant-centric/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "December 18, 2019"
  },
  {
    "title": "Byers Scientific & Manufacturing: Cannabis Cultivation Odor Mitigation",
    "description": "In this webinar, Byers Scientific & Manufacturing presents the various aspects of an efficient and safe odor mitigation strategy for various cultivation styles and sizes.",
    "link": "https://www.cannabisbusinesstimes.com/media/cannabis-cultivation-odor-mitigation-byers-scientific-manufacturing-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 25, 2019"
  },
  {
    "title": "Valoya: Latest Developments in Research on LED for Cannabis",
    "description": "LED experts from Valoya discuss the latest research in this Cannabis Business Times webinar.",
    "link": "https://www.cannabisbusinesstimes.com/media/valoya-latest-research-led-cannabis-lighting/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "November 07, 2019"
  },
  {
    "title": "Moving Beyond the Sativa-Indica Myth",
    "description": "This educational webinar offers new ways of thinking about the words “sativa” and “indica,” exposing scientific truths about the cannabis plant and helping business owners find new ways to teach consumers what it is they’re buying and using.",
    "link": "https://www.cannabisbusinesstimes.com/media/moving-beyond-sativa-indica-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "October 10, 2019"
  },
  {
    "title": "How to Capitalize on Emerging Trends in the Legal U.S. Hemp Market",
    "description": "Industry observers provide important insights into the early trends and market forces shaping the newly legal U.S. hemp industry.",
    "link": "https://www.cannabisbusinesstimes.com/media/hemp-industry-trends-panxchange-webinar-julie-lerner-rj-hopp/",
    "event_type": "webinar",
    "author": "Posted by Eric Sandy",
    "date": "September 06, 2019"
  },
 
  {
    "title": "Fluence by OSRAM: Adjusting Your Environment  How Lighting Affects Nutrients, HVAC and IPM",
    "description": "Sean Sangster, horticulture specialist with Fluence by OSRAM, discusses the balance of environmental inputs when changing lighting.",
    "link": "https://www.cannabisbusinesstimes.com/media/webinar-fluence-osram-how-lighting-affects-nutrients-hvac-ipm/",
    "event_type": "webinar",
    "author": "Posted by Eric Sandy",
    "date": "August 05, 2019"
  },
  {
    "title": "Supporting the Cannabis Industry with Industry Best Practice and Regulatory Compliance",
    "description": "Neil Coole, Director - Food & Retail for BSI Americas, outlines ways for brand owners, retailers and manufacturers to deal with key industry challenges.",
    "link": "https://www.cannabisbusinesstimes.com/media/cannabis-industry-best-practice-regulatory-compliance-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "May 28, 2019"
  },
  {
    "title": "When It's Time to Terminate Your Cannabis Employee, Will You Be Prepared?",
    "description": "Learn how to identify and address problems before they affect a broader corporate team, as well as how to navigate potential challenges when an employee must be let go.",
    "link": "https://www.cannabisbusinesstimes.com/media/learn-how-to-terminate-cannabis-employee-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "March 29, 2019"
  },
  {
    "title": "Hiring in the 21st Century. How Your Cannabis Company Culture Changes Everything",
    "description": "Learn how to define what you value in an employee and how to attract top talent to this dynamic marketplace.",
    "link": "https://www.cannabisbusinesstimes.com/media/hiring-21st-century-cannabis-company-culture-webinar/",
    "event_type": "webinar",
    "author": "CBT Staff",
    "date": "February 28, 2019"
  }
]